Revit 2026 API

# WireTypeSetErase Method

---

Removes a specified wire type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	WireType item
)
```
```vb
Public Overridable Function Erase (
	item As WireType
) As Integer
```
```cpp
public:
virtual int Erase(
	WireType^ item
)
```
```fsharp
abstract Erase :
        item : WireType -> int
override Erase :
        item : WireType -> int
```

#### Parameters

item WireType
    The wire type to be erased.

#### Return Value

Int32The number of wire types that were erased from the set.

#### Reference

WireTypeSet Class

Autodesk.Revit.DB.Electrical Namespace